In [1]:
import numpy as np
import pandas as pd

In [2]:
sudarshan = pd.read_csv('sudarshan.csv')

In [3]:
sudarshan

  Unnamed: 0  Train No  Speed       City
0      first     12009     80     Nagpur
1     second     23555     45     Mumbai
2      third     45676     66   Kolhapur
3     fourth     38774     99  Karnataka

In [4]:
sudarshan.index=['first','second','third','fourth']

In [5]:
sudarshan

       Unnamed: 0  Train No  Speed       City
first       first     12009     80     Nagpur
second     second     23555     45     Mumbai
third       third     45676     66   Kolhapur
fourth     fourth     38774     99  Karnataka

In [6]:
sudarshan['Speed']

first     80
second    45
third     66
fourth    99
Name: Speed, dtype: int64

In [7]:
sudarshan['Speed']['first'] = 80

C:\Users\reliance\AppData\Local\Temp\ipykernel_3928\1427154190.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sudarshan['Speed']['first'] = 80

In [8]:
sudarshan

       Unnamed: 0  Train No  Speed       City
first       first     12009     80     Nagpur
second     second     23555     45     Mumbai
third       third     45676     66   Kolhapur
fourth     fourth     38774     99  Karnataka

In [9]:
sudarshan.to_csv('sudarshan.csv')

In [10]:
sudarshan

       Unnamed: 0  Train No  Speed       City
first       first     12009     80     Nagpur
second     second     23555     45     Mumbai
third       third     45676     66   Kolhapur
fourth     fourth     38774     99  Karnataka

In [11]:
sudarshan.describe()

           Train No      Speed
count      4.000000   4.000000
mean   30003.500000  72.500000
std    15143.030399  22.781571
min    12009.000000  45.000000
25%    20668.500000  60.750000
50%    31164.500000  73.000000
75%    40499.500000  84.750000
max    45676.000000  99.000000